contrib-other/camelse/examples/jbi2file/JBI2FileCamelCompositeApp/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:jbi2="http://openesb.org/jbi2camel/message/JBI2FileCamelJBIModule">
  <soapenv:Body>
    <jbi2:AnyMessage>Hello Camel...</jbi2:AnyMessage>
  </soapenv:Body>
</soapenv:Envelope>